In [2]:
import pandas as pd
import numpy as np
from pandas import Series

In [3]:
data = {
    'Viloyat' : ["Andijon","Buxoro","Farg'ona","Jizzax","Xorazm","Namangan","Navoiy","Qashqadaryo","Qoraqalpog'iston Respublikasi","Samarqand","Sirdaryo","Surxondaryo","Toshkent"]
}

In [4]:
vil = {1 : "Andijon", 2 : "Buxoro",3 : "Farg'ona", 4 : "Jizzax", 5 : "Xorazm", 6 : "Namangan", 7 : "Navoiy", 8 : "Qashqadaryo", 9 : "Qoraqalpog'iston Respublikasi", 10 : "Samarqand", 11 : "Sirdaryo", 12 : "Surxondaryo", 13 : "Toshkent"}
soni = {1 : 1899000, 2 : 1384700, 3 : 2597000, 4 : 910500, 5 : 1200000, 6 : 1862000, 7 : 767500, 8 : 2029000, 9 : 1200000, 10 : 2322000, 11 : 648100, 12 : 1676000, 13 : 4450000}
df = pd.DataFrame(
    {
        'Viloyatlar' : vil,
        'Aholi soni' : soni
    }
)

In [5]:
df

                       Viloyatlar  Aholi soni
1                         Andijon     1899000
2                          Buxoro     1384700
3                        Farg'ona     2597000
4                          Jizzax      910500
5                          Xorazm     1200000
6                        Namangan     1862000
7                          Navoiy      767500
8                     Qashqadaryo     2029000
9   Qoraqalpog'iston Respublikasi     1200000
10                      Samarqand     2322000
11                       Sirdaryo      648100
12                    Surxondaryo     1676000
13                       Toshkent     4450000

In [6]:
df.iloc[-1]

Viloyatlar    Toshkent
Aholi soni     4450000
Name: 13, dtype: object

In [7]:
df.size

26

In [8]:
df.loc[[6,7,8]]

    Viloyatlar  Aholi soni
6     Namangan     1862000
7       Navoiy      767500
8  Qashqadaryo     2029000

In [9]:
df.iloc[[3,1,5]]

  Viloyatlar  Aholi soni
4     Jizzax      910500
2     Buxoro     1384700
6   Namangan     1862000

In [10]:
print("Aholi soni 1 milionnan ko'p viloyatlar")
df[df['Aholi soni'] >= 1000000]

Aholi soni 1 milionnan ko'p viloyatlar

                       Viloyatlar  Aholi soni
1                         Andijon     1899000
2                          Buxoro     1384700
3                        Farg'ona     2597000
5                          Xorazm     1200000
6                        Namangan     1862000
8                     Qashqadaryo     2029000
9   Qoraqalpog'iston Respublikasi     1200000
10                      Samarqand     2322000
12                    Surxondaryo     1676000
13                       Toshkent     4450000

In [11]:
print("Aholi soni 1 milionnan kam viloyatlar")
df[df['Aholi soni'] <= 1000000]

Aholi soni 1 milionnan kam viloyatlar

   Viloyatlar  Aholi soni
4      Jizzax      910500
7      Navoiy      767500
11   Sirdaryo      648100

In [12]:
dict = {
    "Andijon": 4200,
    "Buxoro": 39400,
    "Farg'ona": 6800,
    "Jizzax": 20500,
    "Xorazm": 6300,
    "Namangan": 7900,
    "Navoiy": 110800,
    "Qashqadaryo": 28400,
    "Qoraqalpog'iston Respublikasi": 160000,
    "Samarqand": 16400,
    "Sirdaryo": 5100,
    "Surxondaryo": 20800,
    "Toshkent": 15300,
    
}
obj = pd.Series(dict)
obj.name = "Hududlar maydoni"
print(obj)

Andijon                            4200
Buxoro                            39400
Farg'ona                           6800
Jizzax                            20500
Xorazm                             6300
Namangan                           7900
Navoiy                           110800
Qashqadaryo                       28400
Qoraqalpog'iston Respublikasi    160000
Samarqand                         16400
Sirdaryo                           5100
Surxondaryo                       20800
Toshkent                          15300
Name: Hududlar maydoni, dtype: int64

In [13]:
print(f"Eng katta Hudud: {obj.idxmax()}")
print(f"Eng kishik Hudud:{obj.idxmin()}")

Eng katta Hudud: Qoraqalpog'iston Respublikasi
Eng kishik Hudud:Andijon

In [14]:
sum(obj)

441900

In [15]:
sum(df['Aholi soni'])

22945800

In [16]:
print("Aholi soni 1 millionnan ko'p viloyatlar")
df2 = df[df['Aholi soni'] > 1000000]
df2

Aholi soni 1 millionnan ko'p viloyatlar

                       Viloyatlar  Aholi soni
1                         Andijon     1899000
2                          Buxoro     1384700
3                        Farg'ona     2597000
5                          Xorazm     1200000
6                        Namangan     1862000
8                     Qashqadaryo     2029000
9   Qoraqalpog'iston Respublikasi     1200000
10                      Samarqand     2322000
12                    Surxondaryo     1676000
13                       Toshkent     4450000

In [17]:
print("Aholi soni 1 millionnan kam viloyatlar")
df3 = df[df['Aholi soni'] < 1000000]
df3

Aholi soni 1 millionnan kam viloyatlar

   Viloyatlar  Aholi soni
4      Jizzax      910500
7      Navoiy      767500
11   Sirdaryo      648100

In [18]:
print("Hududlar maydoni bo'yicha tartiblash")
obj.sort_values()

Hududlar maydoni bo'yicha tartiblash

Andijon                            4200
Sirdaryo                           5100
Xorazm                             6300
Farg'ona                           6800
Namangan                           7900
Toshkent                          15300
Samarqand                         16400
Jizzax                            20500
Surxondaryo                       20800
Qashqadaryo                       28400
Buxoro                            39400
Navoiy                           110800
Qoraqalpog'iston Respublikasi    160000
Name: Hududlar maydoni, dtype: int64

In [19]:
print("Aholi soni bo'yicha tartiblash")
df.sort_values

Aholi soni bo'yicha tartiblash

<bound method DataFrame.sort_values of                        Viloyatlar  Aholi soni
1                         Andijon     1899000
2                          Buxoro     1384700
3                        Farg'ona     2597000
4                          Jizzax      910500
5                          Xorazm     1200000
6                        Namangan     1862000
7                          Navoiy      767500
8                     Qashqadaryo     2029000
9   Qoraqalpog'iston Respublikasi     1200000
10                      Samarqand     2322000
11                       Sirdaryo      648100
12                    Surxondaryo     1676000
13                       Toshkent     4450000>

In [20]:
'Navoiy' in df[df['Aholi soni'] > 1000000]

False

In [21]:
'Toshkent' in df[df['Aholi soni'] > 1000000]

False

In [22]:
print(f"Eng katta hudud : {obj.idxmax()}")
print(f"Eng kichik hudud : {obj.idxmin()}")

Eng katta hudud : Qoraqalpog'iston Respublikasi
Eng kichik hudud : Andijon

In [34]:
print("Aholi soni bo'yicha tartiblash")
df2['Aholi soni'].sort_values()

Aholi soni bo'yicha tartiblash

5     1200000
9     1200000
2     1384700
12    1676000
6     1862000
1     1899000
8     2029000
10    2322000
3     2597000
13    4450000
Name: Aholi soni, dtype: int64

In [35]:
df

                       Viloyatlar  Aholi soni
1                         Andijon     1899000
2                          Buxoro     1384700
3                        Farg'ona     2597000
4                          Jizzax      910500
5                          Xorazm     1200000
6                        Namangan     1862000
7                          Navoiy      767500
8                     Qashqadaryo     2029000
9   Qoraqalpog'iston Respublikasi     1200000
10                      Samarqand     2322000
11                       Sirdaryo      648100
12                    Surxondaryo     1676000
13                       Toshkent     4450000